export const cv = [
  {
    id: "1",
    uploader_id: "",
    favorite: false,
    status: "Прошел интервью",
    firstName: "Константин",
    lastName: "Шмураков",
    middleName: "Русланович",
    gender: "Мужчина",
    birthday: "2005-05-02",
    metric: 95,

    phone: "79493432276",
    email: "kostya.shmurakov@mail.ru",

    country: "Россия",
    city: "Москва",
    transfer: true,

    position: "Frontend-разработчик",
    specializations: ["Программист, разработчик"],
    employment: ["полная занятость"],
    schedule: ["полный день"],

    skills: ["Java", "Python"],

    jobs: [
      {
        company: "ПромСвязьБанк",
        position: "Junior Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2014-09-01",
        end: "2015-07-01",
      },
      {
        company: "ПромСвязьБанк",
        position: "Middle Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2015-09-01",
        end: "2017-11-01",
      },
      {
        company: "Tinkoff",
        position: "Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2017-12-01",
        end: "2021-12-01",
      },
      {
        company: "Сбер",
        position: "Frontend",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2021-12-02",
        end: "2024-06-01",
      },
    ],
    education: [
      {
        years: "2024",
        name: "Донецкий национальный технический университет, Донецк",
        description:
          "Факультет информационных систем и программирования, Программная инженерия",
      },
    ],
  },
  {
    id: "2",
    uploader_id: "",
    favorite: false,
    status: "Прошел интервью",
    firstName: "Константин",
    lastName: "Шмураков",
    middleName: "Русланович",
    gender: "Мужчина",
    birthday: "2005-05-02",
    metric: 32,

    phone: "79493432276",
    email: "kostya.shmurakov@mail.ru",

    country: "Россия",
    city: "Москва",
    transfer: true,

    position: "Frontend-разработчик",
    specializations: ["Программист, разработчик"],
    employment: ["полная занятость"],
    schedule: ["полный день"],

    skills: ["Java", "Python"],

    jobs: [
      {
        company: "ПромСвязьБанк",
        position: "Junior Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2014-09-01",
        end: "2015-07-01",
      },
      {
        company: "ПромСвязьБанк",
        position: "Middle Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2015-09-01",
        end: "2017-11-01",
      },
      {
        company: "Tinkoff",
        position: "Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2017-12-01",
        end: "2021-12-01",
      },
      {
        company: "Сбер",
        position: "Frontend",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2021-12-02",
        end: "2024-06-01",
      },
    ],
    education: [
      {
        years: "2024",
        name: "Донецкий национальный технический университет, Донецк",
        description:
          "Факультет информационных систем и программирования, Программная инженерия",
      },
    ],
  },
  {
    id: "3",
    uploader_id: "",
    favorite: false,
    status: "Прошел интервью",
    firstName: "Константин",
    lastName: "Шмураков",
    middleName: "Русланович",
    gender: "Мужчина",
    birthday: "2005-05-02",
    metric: 48,

    phone: "79493432276",
    email: "kostya.shmurakov@mail.ru",

    country: "Россия",
    city: "Москва",
    transfer: true,

    position: "Frontend-разработчик",
    specializations: ["Программист, разработчик"],
    employment: ["полная занятость"],
    schedule: ["полный день"],

    skills: ["Java", "Python"],

    jobs: [
      {
        company: "ПромСвязьБанк",
        position: "Junior Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2014-09-01",
        end: "2015-07-01",
      },
      {
        company: "ПромСвязьБанк",
        position: "Middle Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2015-09-01",
        end: "2017-11-01",
      },
      {
        company: "Tinkoff",
        position: "Frontend-developer",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2017-12-01",
        end: "2021-12-01",
      },
      {
        company: "Сбер",
        position: "Frontend",
        description: `Разработка масштабируемого веб-приложения для управления складскими операциями в транспортной компании.

      Основные задачи и обязанности:
      Разработка и поддержка микросервисов, включая полный цикл от проектирования до развертывания и поддержки продакшн-окружения.
      Рефакторинг существующего кода для повышения эффективности, масштабируемости и поддерживаемости системы.
      Создание юнит и интеграционных тестов для обеспечения стабильности и качества продукта.
      Проведение код-ревью для улучшения качества кода и обмена знаниями внутри команды.
      
      Ключевые достижения:
      Реализация и оптимизация микросервиса для управления поступлением грузов, включая разработку API и баз данных для хранения информации о грузах.
      Разработка и интеграция сервиса уведомлений для информирования клиентов о статусах их запросов через API.
      Создание и поддержка микросервиса каталога складских позиций, управление каталогом товаров.
      
      Java 11, Spring, Kafka, CI/CD, PostgreSQL, Jenkins,Grafana, Git, микросервисы`,
        start: "2021-12-02",
        end: "2024-06-01",
      },
    ],
    education: [
      {
        years: "2024",
        name: "Донецкий национальный технический университет, Донецк",
        description:
          "Факультет информационных систем и программирования, Программная инженерия",
      },
    ],
  },
];
